app/views/authors/_form.html.erb

    <%= form.label :country_id %>
    <%= collection_select(:author, :country_id, Country.all, :id, :name) %>
---
SELECT "countries".* FROM "countries"

    <%= form.label :language_id %>
    <%= collection_select(:author, :language_id, Language.all, :id, :language) %>
---
SELECT "languages".* FROM "languages"