app/views/books/_form.html.erb

SELECT "authors".* FROM "authors"
---
    <%= form.label :author_id %>
    <%= collection_select(:book, :author_id, Author.all, :id, :full_name) %>