app/views/chapters/_form.html.erb

SELECT "books".* FROM "books"
---
    <%= form.label :book_id %>
    <%= collection_select(:chapter, :book_id, Book.all, :id, :title) %>