app/views/paragraphs/_form.html.erb

    <%= form.label :chapter_id %>
    <%= collection_select(:paragraph, :chapter_id, Chapter.all, :id, :title) %>
---
SELECT "chapters".* FROM "chapters"